{
  "header": {
    "home": "الرئيسية",
    "projects": "اعمالنا",
    "blog": "المدونة",
    "contact": " اتصل بنا"
  },
  "hero_home": {
    "title": "استشارات متعلقة بالتكنولوجيا",
    "content": "نحول الأفكار إلى تكنولوجيا",
    "description": "نقدم التصميم الأكثر استجابة ووظائف لتكنولوجيا المعلومات للشركات والأعمال في جميع أنحاء العالم.",
    "button": "اقرأ المزيد"
  },
  "workflows": {
    "title": "خدماتنا الأساسية",
    "content": "حلول مبتكرة لنجاحك",
    "description": "حلول أنيقة لتطوير الويب، تطبيقات الجوال، التسويق الرقمي، ونمو الأعمال، مصممة لتحقيق النجاح.",

    "card1": {
      "title": "تطوير الويب",
      "content": "تطوير الويب ينشئ ويحافظ على المواقع أو التطبيقات، مع التركيز على الواجهة الأمامية، الخلفية، الوظائف، الاستجابة، وتجربة المستخدم."
    },
    "card2": {
      "title": "تطبيقات الجوال",
      "content": "تطوير تطبيقات الجوال ينشئ برامج للهواتف الذكية، ويتضمن التصميم، الترميز، الاختبار، والنشر لتحقيق الوظائف، الترفيه، أو المعلومات."
    },
    "card3": {
      "title": "الأمن السيبراني",
      "content": "الأمن السيبراني يحمي الأنظمة، الشبكات، والبيانات من الهجمات الرقمية، مما يضمن سرية، سلامة، وتوافر المعلومات الحساسة."
    },
    "card4": {
      "title": "التسويق الرقمي",
      "content": "التسويق الرقمي يستخدم القنوات عبر الإنترنت مثل تحسين محركات البحث، وسائل التواصل الاجتماعي، حملات البريد الإلكتروني، وإنشاء المحتوى لتعزيز رؤية المنتج والترويج."
    },
    "card5": {
      "title": "نمو الأعمال",
      "content": "نمو الأعمال هو وظيفة من دورة حياة الأعمال، اتجاهات نمو الصناعة، ورغبة المالكين في خلق قيمة الأسهم."
    },
    "card6": {
      "title": "تحسين محركات البحث",
      "content": "تحسين محركات البحث هو عملية تحسين جودة وكمية حركة المرور إلى موقع ويب أو صفحة ويب من محركات البحث."
    }
  },
 "home_blog": {
    "title": "أحدث منشورات المدونة",
    "content": "أحدث أخبارنا",
    "description": "نقدم التصميم الأكثر استجابة ووظائف لتكنولوجيا المعلومات للشركات والأعمال في جميع أنحاء العالم.",
    "blog": {
      "card1": {
      "title": "توافق المتصفح",
      "parg1": "دعونا نتحدث قليلاً عن توافق المتصفح... أحيانًا تكتب الكود وتعد الصفحة، وتعمل بشكل مثالي على Chrome. ولكن عندما تفتحها على Safari أو Firefox أو حتى Internet Explorer، يكون كل شيء مختلطًا، كما لو كنت على كوكب آخر!"
      },
      "card2": {
      "title": "ميزات وتحسينات Laravel 11 الجديدة",
      "parg": "Lazy Collections! إذا كنت تتعامل مع كميات كبيرة من البيانات وترغب في تحسين استخدام الذاكرة، فهي الحل الأمثل. تتيح لك هذه الميزة معالجة كميات كبيرة من البيانات دون تحميلها دفعة واحدة في الذاكرة، مما يحسن سرعة وكفاءة التطبيق. كيفية استخدام Lazy Collections؟ إليك مثال بسيط يوضح كيفية استخدام lazy() مع وظيفة where: $users = User::lazy()->whereStatus('active')->get(); في هذا المثال، نستخدم lazy() لتحميل المستخدمين ذوي الحالة النشطة تدريجيًا. يمكننا استخدام where متبوعة باسم العمود (مثل الحالة) والقيمة التي نريد التحقق منها. لماذا تعتبر Lazy Collections مفيدة؟ تقليل حمل الخادم: عند استخدام lazy()، يتم تحميل البيانات تدريجيًا، مما يقلل من حمل الذاكرة ويضمن أداءً أفضل. تبسيط الكود: يمكنك استخدام وظيفة where متبوعة باسم العمود (مثل الحالة) داخل الأقواس، مع القيمة التي تريد التحقق منها، مما يجعل الكود أنظف وأكثر وضوحًا."
      },
      "card3": {
      "title": "الواجهة الأمامية المصغرة",
      "parg": "Micro Frontend هو فكرة رائعة للفرق التي ترغب في دمج أطر عمل مختلفة مثل React وAngular وVue في مشروع واحد. تتيح لنا الفكرة استخدام نقاط القوة في كل إطار عمل حيث يناسبها الأفضل، مثل الاستفادة من React لبناء المكونات، وAngular للتنظيم القوي، وVue للمرونة. فائدة Micro Frontend هي أنها تساعد في تقسيم المشروع إلى أجزاء مستقلة، يمكن لكل منها أن تدار بواسطة فريق منفصل. هذا يمنحنا مرونة عالية في إدارة وتحديث المشروع دون التأثير على الأجزاء الأخرى. هذه خطوة ممتازة لأي مطور واجهة أمامية يرغب في تحسين مهاراته، لأن تطوير الواجهة الأمامية ليس مجرد 'تصميم' كما يعتقد البعض."
      },
      "card4": {
      "title": "ما هو CSRF؟",
      "parg": "دعونا نتحدث عن شيء ربما سمعت عنه كثيرًا  إذا كنت مهتمًا بتأمين تطبيقات الويب، وهو CSRF أو تزوير الطلب عبر المواقع. يشير هذا المصطلح إلى نوع معين من الهجمات السيبرانية التي يمكن أن تؤثر على الأمان إذا لم يتم تصميم التطبيق وتأمينه بشكل صحيح. فما هي فكرته وكيف تعمل هذه الهجمة؟ إذا كنت مسجلاً الدخول إلى موقع معين (لنقل حسابك المصرفي أو حسابك على وسائل التواصل الاجتماعي)، ويستخدم الموقع الجلسات أو الكوكيز للحفاظ على حالة تسجيل الدخول الخاصة بك، تبدأ الهجمة عندما يحاول المخترق استغلال نقطة معينة: الموقع لا يمكنه معرفة ما إذا كنت أنت من قام بهذا الطلب. على سبيل المثال، يرسل لك رابطًا ضارًا أو صورة على موقع آخر. إذا نقرت عليها أثناء تسجيل الدخول إلى الموقع الآخر (مثل البنك الخاص بك)، يمكن للمخترق إرسال طلب إلى الموقع نيابة عنك وتنفيذ إجراءات لم تطلبها. كيف يعمل CSRF؟ - تسجيل الدخول إلى الموقع: على سبيل المثال، أنت مسجل الدخول إلى حسابك المصرفي. - يرسل لك المخترق رابطًا ضارًا أو صورة على موقع أو عبر البريد الإلكتروني، وتنقر عليها أثناء تسجيل الدخول إلى موقع البنك. - إذا كان هناك حماية غير كافية، قد يصل الطلب الذي نقرت عليه إلى موقع البنك، كما لو كنت أنت من أرسله. مثال بسيط لما يمكن أن يحدث: يمكن للمخترق إرسال رابط يحتوي على طلب لتحويل الأموال إلى حساب معين. عندما تنقر على الرابط، يتلقى موقع البنك الطلب ويعتقد أنه أرسل من قبلك، طالما أنك مسجل الدخول. كيف يمكننا حماية أنفسنا؟ هناك العديد من الحلول التقنية لمنع هذه الهجمة، أهمها: رموز CSRF: هذه رموز يتم إنشاؤها عشوائيًا في كل مرة تفتح فيها صفحة جديدة أو تقوم بطلب معين. إذا لم يتضمن الطلب الرمز، يرفض الموقع الطلب ويمنعه. كوكيز SameSite: هذا إعداد في الكوكيز يمنع إرسالها من مواقع أخرى، مما يقلل من فرص تنفيذ الطلبات من خارج الموقع نفسه. التحقق من رأس Referrer: يتحقق الموقع من مصدر الطلب لمعرفة ما إذا كان من نفس الموقع أو من موقع آخر. لماذا من المهم الحماية من CSRF؟ هذه الهجمة خطيرة للغاية لأن المستخدم لا يدرك أنه يتعرض للهجوم ويعتقد أن كل شيء على ما يرام، ولكن يمكن للمخترق تنفيذ أي طلبات على الحساب كما لو كان المستخدم. بالإضافة إلى ذلك، يمكن أن تتضرر المواقع نفسها إذا استغل شخص ما هذه الثغرة لأشياء مثل التحويلات المالية أو تغييرات الحساب."
      }
    }
    }
}
